PanBabinicz/arm_assembly/share/stm32f446re_gpio.inc
    .equ gpiox_moder_moder11_position,      (0x16)
    .equ gpiox_moder_moder11_mask,          (0x03 << gpiox_moder_moder11_position)
    .equ gpiox_moder_moder11,               (gpiox_moder_moder11_mask)
    .equ gpiox_moder_moder11_bit0,          (0x01 << gpiox_moder_moder11_position)
    .equ gpiox_moder_moder11_bit1,          (0x02 << gpiox_moder_moder11_position)

    .equ gpiox_moder_moder12_position,      (0x18)
    .equ gpiox_moder_moder12_mask,          (0x03 << gpiox_moder_moder12_position)
    .equ gpiox_moder_moder12,               (gpiox_moder_moder12_mask)
    .equ gpiox_moder_moder12_bit0,          (0x01 << gpiox_moder_moder12_position)
    .equ gpiox_moder_moder12_bit1,          (0x02 << gpiox_moder_moder12_position)

    .equ gpiox_moder_moder13_position,      (0x1a)
    .equ gpiox_moder_moder13_mask,          (0x03 << gpiox_moder_moder13_position)
    .equ gpiox_moder_moder13,               (gpiox_moder_moder13_mask)
    .equ gpiox_moder_moder13_bit0,          (0x01 << gpiox_moder_moder13_position)
    .equ gpiox_moder_moder13_bit1,          (0x02 << gpiox_moder_moder13_position)

    .equ gpiox_moder_moder14_position,      (0x1c)
    .equ gpiox_moder_moder14_mask,          (0x03 << gpiox_moder_moder14_position)
    .equ gpiox_moder_moder14,               (gpiox_moder_moder14_mask)
    .equ gpiox_moder_moder14_bit0,          (0x01 << gpiox_moder_moder14_position)
    .equ gpiox_moder_moder14_bit1,          (0x02 << gpiox_moder_moder14_position)

    .equ gpiox_moder_moder15_position,      (0x1e)
    .equ gpiox_moder_moder15_mask,          (0x03 << gpiox_moder_moder15_position)
    .equ gpiox_moder_moder15,               (gpiox_moder_moder15_mask)
    .equ gpiox_moder_moder15_bit0,          (0x01 << gpiox_moder_moder15_position)
    .equ gpiox_moder_moder15_bit1,          (0x02 << gpiox_moder_moder15_position)


@-----------------------------------------------------------------------------------------------@
@--------------------------------- GPIOx OTYPE register fields ---------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ gpiox_otyper_ot0_position,         (0x00)
    .equ gpiox_otyper_ot0_mask,             (0x01 << gpiox_otyper_ot0_position)
    .equ gpiox_otyper_ot0,                  (gpiox_otyper_ot0_mask)

    .equ gpiox_otyper_ot1_position,         (0x01)
    .equ gpiox_otyper_ot1_mask,             (0x01 << gpiox_otyper_ot1_position)
    .equ gpiox_otyper_ot1,                  (gpiox_otyper_ot1_mask)

    .equ gpiox_otyper_ot2_position,         (0x02)
    .equ gpiox_otyper_ot2_mask,             (0x01 << gpiox_otyper_ot2_position)
    .equ gpiox_otyper_ot2,                  (gpiox_otyper_ot2_mask)

    .equ gpiox_otyper_ot3_position,         (0x03)
    .equ gpiox_otyper_ot3_mask,             (0x01 << gpiox_otyper_ot3_position)
    .equ gpiox_otyper_ot3,                  (gpiox_otyper_ot3_mask)

    .equ gpiox_otyper_ot4_position,         (0x04)
    .equ gpiox_otyper_ot4_mask,             (0x01 << gpiox_otyper_ot4_position)
    .equ gpiox_otyper_ot4,                  (gpiox_otyper_ot4_mask)

    .equ gpiox_otyper_ot5_position,         (0x05)
    .equ gpiox_otyper_ot5_mask,             (0x01 << gpiox_otyper_ot5_position)
    .equ gpiox_otyper_ot5,                  (gpiox_otyper_ot5_mask)

    .equ gpiox_otyper_ot6_position,         (0x06)
    .equ gpiox_otyper_ot6_mask,             (0x01 << gpiox_otyper_ot6_position)
    .equ gpiox_otyper_ot6,                  (gpiox_otyper_ot6_mask)

    .equ gpiox_otyper_ot7_position,         (0x07)
    .equ gpiox_otyper_ot7_mask,             (0x01 << gpiox_otyper_ot7_position)
    .equ gpiox_otyper_ot7,                  (gpiox_otyper_ot7_mask)

    .equ gpiox_otyper_ot8_position,         (0x08)
    .equ gpiox_otyper_ot8_mask,             (0x01 << gpiox_otyper_ot8_position)
    .equ gpiox_otyper_ot8,                  (gpiox_otyper_ot8_mask)

    .equ gpiox_otyper_ot9_position,         (0x09)
    .equ gpiox_otyper_ot9_mask,             (0x01 << gpiox_otyper_ot9_position)
    .equ gpiox_otyper_ot9,                  (gpiox_otyper_ot9_mask)

    .equ gpiox_otyper_ot10_position,        (0x0a)
    .equ gpiox_otyper_ot10_mask,            (0x01 << gpiox_otyper_ot10_position)
    .equ gpiox_otyper_ot10,                 (gpiox_otyper_ot10_mask)

    .equ gpiox_otyper_ot11_position,        (0x0b)
    .equ gpiox_otyper_ot11_mask,            (0x01 << gpiox_otyper_ot11_position)
    .equ gpiox_otyper_ot11,                 (gpiox_otyper_ot11_mask)

    .equ gpiox_otyper_ot12_position,        (0x0c)
    .equ gpiox_otyper_ot12_mask,            (0x01 << gpiox_otyper_ot12_position)
    .equ gpiox_otyper_ot12,                 (gpiox_otyper_ot12_mask)

    .equ gpiox_otyper_ot13_position,        (0x0d)
    .equ gpiox_otyper_ot13_mask,            (0x01 << gpiox_otyper_ot13_position)
    .equ gpiox_otyper_ot13,                 (gpiox_otyper_ot13_mask)

    .equ gpiox_otyper_ot14_position,        (0x0e)
    .equ gpiox_otyper_ot14_mask,            (0x01 << gpiox_otyper_ot14_position)
    .equ gpiox_otyper_ot14,                 (gpiox_otyper_ot14_mask)

    .equ gpiox_otyper_ot15_position,        (0x0f)
    .equ gpiox_otyper_ot15_mask,            (0x01 << gpiox_otyper_ot15_position)
    .equ gpiox_otyper_ot15,                 (gpiox_otyper_ot15_mask)


@-----------------------------------------------------------------------------------------------@
@-------------------------------- GPIOx OSPEEDR register fields --------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ gpiox_ospeedr_ospeedr0_position,   (0x00)
    .equ gpiox_ospeedr_ospeedr0_mask,       (0x03 << gpiox_ospeedr_ospeedr0_position)
    .equ gpiox_ospeedr_ospeedr0,            (gpiox_ospeedr_ospeedr0_mask)
    .equ gpiox_ospeedr_ospeedr0_bit0,       (0x01 << gpiox_ospeedr_ospeedr0_position)
    .equ gpiox_ospeedr_ospeedr0_bit1,       (0x02 << gpiox_ospeedr_ospeedr0_position)

    .equ gpiox_ospeedr_ospeedr1_position,   (0x02)
    .equ gpiox_ospeedr_ospeedr1_mask,       (0x03 << gpiox_ospeedr_ospeedr1_position)
    .equ gpiox_ospeedr_ospeedr1,            (gpiox_ospeedr_ospeedr1_mask)
    .equ gpiox_ospeedr_ospeedr1_bit0,       (0x01 << gpiox_ospeedr_ospeedr1_position)
    .equ gpiox_ospeedr_ospeedr1_bit1,       (0x02 << gpiox_ospeedr_ospeedr1_position)

    .equ gpiox_ospeedr_ospeedr2_position,   (0x04)
    .equ gpiox_ospeedr_ospeedr2_mask,       (0x03 << gpiox_ospeedr_ospeedr2_position)
    .equ gpiox_ospeedr_ospeedr2,            (gpiox_ospeedr_ospeedr2_mask)
    .equ gpiox_ospeedr_ospeedr2_bit0,       (0x01 << gpiox_ospeedr_ospeedr2_position)
    .equ gpiox_ospeedr_ospeedr2_bit1,       (0x02 << gpiox_ospeedr_ospeedr2_position)

    .equ gpiox_ospeedr_ospeedr3_position,   (0x06)
    .equ gpiox_ospeedr_ospeedr3_mask,       (0x03 << gpiox_ospeedr_ospeedr3_position)
    .equ gpiox_ospeedr_ospeedr3,            (gpiox_ospeedr_ospeedr3_mask)
    .equ gpiox_ospeedr_ospeedr3_bit0,       (0x01 << gpiox_ospeedr_ospeedr3_position)
    .equ gpiox_ospeedr_ospeedr3_bit1,       (0x02 << gpiox_ospeedr_ospeedr3_position)

    .equ gpiox_ospeedr_ospeedr4_position,   (0x08)
    .equ gpiox_ospeedr_ospeedr4_mask,       (0x03 << gpiox_ospeedr_ospeedr4_position)
    .equ gpiox_ospeedr_ospeedr4,            (gpiox_ospeedr_ospeedr4_mask)
    .equ gpiox_ospeedr_ospeedr4_bit0,       (0x01 << gpiox_ospeedr_ospeedr4_position)
    .equ gpiox_ospeedr_ospeedr4_bit1,       (0x02 << gpiox_ospeedr_ospeedr4_position)

