PanBabinicz/arm_assembly/share/stm32f446re_gpio.inc
    .equ gpiox_idr_idr11_position,          (0x0b)
    .equ gpiox_idr_idr11_mask,              (0x01 << gpiox_idr_idr11_position)
    .equ gpiox_idr_idr11,                   (gpiox_idr_idr11_mask)

    .equ gpiox_idr_idr12_position,          (0x0c)
    .equ gpiox_idr_idr12_mask,              (0x01 << gpiox_idr_idr12_position)
    .equ gpiox_idr_idr12,                   (gpiox_idr_idr12_mask)

    .equ gpiox_idr_idr13_position,          (0x0d)
    .equ gpiox_idr_idr13_mask,              (0x01 << gpiox_idr_idr13_position)
    .equ gpiox_idr_idr13,                   (gpiox_idr_idr13_mask)

    .equ gpiox_idr_idr14_position,          (0x0e)
    .equ gpiox_idr_idr14_mask,              (0x01 << gpiox_idr_idr14_position)
    .equ gpiox_idr_idr14,                   (gpiox_idr_idr14_mask)

    .equ gpiox_idr_idr15_position,          (0x0f)
    .equ gpiox_idr_idr15_mask,              (0x01 << gpiox_idr_idr15_position)
    .equ gpiox_idr_idr15,                   (gpiox_idr_idr15_mask)


@-----------------------------------------------------------------------------------------------@
@-------------------------------- GPIOx ODR register fields ------------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ gpiox_odr_odr0_position,           (0x00)
    .equ gpiox_odr_odr0_mask,               (0x01 << gpiox_odr_odr0_position)
    .equ gpiox_odr_odr0,                    (gpiox_odr_odr0_mask)

    .equ gpiox_odr_odr1_position,           (0x01)
    .equ gpiox_odr_odr1_mask,               (0x01 << gpiox_odr_odr1_position)
    .equ gpiox_odr_odr1,                    (gpiox_odr_odr1_mask)

    .equ gpiox_odr_odr2_position,           (0x02)
    .equ gpiox_odr_odr2_mask,               (0x01 << gpiox_odr_odr2_position)
    .equ gpiox_odr_odr2,                    (gpiox_odr_odr2_mask)

    .equ gpiox_odr_odr3_position,           (0x03)
    .equ gpiox_odr_odr3_mask,               (0x01 << gpiox_odr_odr3_position)
    .equ gpiox_odr_odr3,                    (gpiox_odr_odr3_mask)

    .equ gpiox_odr_odr4_position,           (0x04)
    .equ gpiox_odr_odr4_mask,               (0x01 << gpiox_odr_odr4_position)
    .equ gpiox_odr_odr4,                    (gpiox_odr_odr4_mask)

    .equ gpiox_odr_odr5_position,           (0x05)
    .equ gpiox_odr_odr5_mask,               (0x01 << gpiox_odr_odr5_position)
    .equ gpiox_odr_odr5,                    (gpiox_odr_odr5_mask)

    .equ gpiox_odr_odr6_position,           (0x06)
    .equ gpiox_odr_odr6_mask,               (0x01 << gpiox_odr_odr6_position)
    .equ gpiox_odr_odr6,                    (gpiox_odr_odr6_mask)

    .equ gpiox_odr_odr7_position,           (0x07)
    .equ gpiox_odr_odr7_mask,               (0x01 << gpiox_odr_odr7_position)
    .equ gpiox_odr_odr7,                    (gpiox_odr_odr7_mask)

    .equ gpiox_odr_odr8_position,           (0x08)
    .equ gpiox_odr_odr8_mask,               (0x01 << gpiox_odr_odr8_position)
    .equ gpiox_odr_odr8,                    (gpiox_odr_odr8_mask)

    .equ gpiox_odr_odr9_position,           (0x09)
    .equ gpiox_odr_odr9_mask,               (0x01 << gpiox_odr_odr9_position)
    .equ gpiox_odr_odr9,                    (gpiox_odr_odr9_mask)

    .equ gpiox_odr_odr10_position,          (0x0a)
    .equ gpiox_odr_odr10_mask,              (0x01 << gpiox_odr_odr10_position)
    .equ gpiox_odr_odr10,                   (gpiox_odr_odr10_mask)

    .equ gpiox_odr_odr11_position,          (0x0b)
    .equ gpiox_odr_odr11_mask,              (0x01 << gpiox_odr_odr11_position)
    .equ gpiox_odr_odr11,                   (gpiox_odr_odr11_mask)

    .equ gpiox_odr_odr12_position,          (0x0c)
    .equ gpiox_odr_odr12_mask,              (0x01 << gpiox_odr_odr12_position)
    .equ gpiox_odr_odr12,                   (gpiox_odr_odr12_mask)

    .equ gpiox_odr_odr13_position,          (0x0d)
    .equ gpiox_odr_odr13_mask,              (0x01 << gpiox_odr_odr13_position)
    .equ gpiox_odr_odr13,                   (gpiox_odr_odr13_mask)

    .equ gpiox_odr_odr14_position,          (0x0e)
    .equ gpiox_odr_odr14_mask,              (0x01 << gpiox_odr_odr14_position)
    .equ gpiox_odr_odr14,                   (gpiox_odr_odr14_mask)

    .equ gpiox_odr_odr15_position,          (0x0f)
    .equ gpiox_odr_odr15_mask,              (0x01 << gpiox_odr_odr15_position)
    .equ gpiox_odr_odr15,                   (gpiox_odr_odr15_mask)


@-----------------------------------------------------------------------------------------------@
@-------------------------------- GPIOx BSRR register fields -----------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ gpiox_bsrr_bs0_position,           (0x00)
    .equ gpiox_bsrr_bs0_mask,               (0x01 << gpiox_bsrr_bs0_position)
    .equ gpiox_bsrr_bs0,                    (gpiox_bsrr_bs0_mask)

    .equ gpiox_bsrr_bs1_position,           (0x01)
    .equ gpiox_bsrr_bs1_mask,               (0x01 << gpiox_bsrr_bs1_position)
    .equ gpiox_bsrr_bs1,                    (gpiox_bsrr_bs1_mask)

    .equ gpiox_bsrr_bs2_position,           (0x02)
    .equ gpiox_bsrr_bs2_mask,               (0x01 << gpiox_bsrr_bs2_position)
    .equ gpiox_bsrr_bs2,                    (gpiox_bsrr_bs2_mask)

    .equ gpiox_bsrr_bs3_position,           (0x03)
    .equ gpiox_bsrr_bs3_mask,               (0x01 << gpiox_bsrr_bs3_position)
    .equ gpiox_bsrr_bs3,                    (gpiox_bsrr_bs3_mask)

    .equ gpiox_bsrr_bs4_position,           (0x04)
    .equ gpiox_bsrr_bs4_mask,               (0x01 << gpiox_bsrr_bs4_position)
    .equ gpiox_bsrr_bs4,                    (gpiox_bsrr_bs4_mask)

    .equ gpiox_bsrr_bs5_position,           (0x05)
    .equ gpiox_bsrr_bs5_mask,               (0x01 << gpiox_bsrr_bs5_position)
    .equ gpiox_bsrr_bs5,                    (gpiox_bsrr_bs5_mask)

    .equ gpiox_bsrr_bs6_position,           (0x06)
    .equ gpiox_bsrr_bs6_mask,               (0x01 << gpiox_bsrr_bs6_position)
    .equ gpiox_bsrr_bs6,                    (gpiox_bsrr_bs6_mask)

    .equ gpiox_bsrr_bs7_position,           (0x07)
    .equ gpiox_bsrr_bs7_mask,               (0x01 << gpiox_bsrr_bs7_position)
    .equ gpiox_bsrr_bs7,                    (gpiox_bsrr_bs7_mask)

    .equ gpiox_bsrr_bs8_position,           (0x08)
    .equ gpiox_bsrr_bs8_mask,               (0x01 << gpiox_bsrr_bs8_position)
    .equ gpiox_bsrr_bs8,                    (gpiox_bsrr_bs8_mask)

    .equ gpiox_bsrr_bs9_position,           (0x09)
    .equ gpiox_bsrr_bs9_mask,               (0x01 << gpiox_bsrr_bs9_position)
    .equ gpiox_bsrr_bs9,                    (gpiox_bsrr_bs9_mask)

    .equ gpiox_bsrr_bs10_position,          (0x0a)
    .equ gpiox_bsrr_bs10_mask,              (0x01 << gpiox_bsrr_bs10_position)
    .equ gpiox_bsrr_bs10,                   (gpiox_bsrr_bs10_mask)

