PanBabinicz/arm_assembly/share/stm32f446re_gpio.inc
    .equ gpiox_bsrr_bs11_position,          (0x0b)
    .equ gpiox_bsrr_bs11_mask,              (0x01 << gpiox_bsrr_bs11_position)
    .equ gpiox_bsrr_bs11,                   (gpiox_bsrr_bs11_mask)

    .equ gpiox_bsrr_bs12_position,          (0x0c)
    .equ gpiox_bsrr_bs12_mask,              (0x01 << gpiox_bsrr_bs12_position)
    .equ gpiox_bsrr_bs12,                   (gpiox_bsrr_bs12_mask)

    .equ gpiox_bsrr_bs13_position,          (0x0d)
    .equ gpiox_bsrr_bs13_mask,              (0x01 << gpiox_bsrr_bs13_position)
    .equ gpiox_bsrr_bs13,                   (gpiox_bsrr_bs13_mask)

    .equ gpiox_bsrr_bs14_position,          (0x0e)
    .equ gpiox_bsrr_bs14_mask,              (0x01 << gpiox_bsrr_bs14_position)
    .equ gpiox_bsrr_bs14,                   (gpiox_bsrr_bs14_mask)

    .equ gpiox_bsrr_bs15_position,          (0x0f)
    .equ gpiox_bsrr_bs15_mask,              (0x01 << gpiox_bsrr_bs15_position)
    .equ gpiox_bsrr_bs15,                   (gpiox_bsrr_bs15_mask)

    .equ gpiox_bsrr_br0_position,           (0x10)
    .equ gpiox_bsrr_br0_mask,               (0x01 << gpiox_bsrr_br0_position)
    .equ gpiox_bsrr_br0,                    (gpiox_bsrr_br0_mask)

    .equ gpiox_bsrr_br1_position,           (0x11)
    .equ gpiox_bsrr_br1_mask,               (0x01 << gpiox_bsrr_br1_position)
    .equ gpiox_bsrr_br1,                    (gpiox_bsrr_br1_mask)

    .equ gpiox_bsrr_br2_position,           (0x12)
    .equ gpiox_bsrr_br2_mask,               (0x01 << gpiox_bsrr_br2_position)
    .equ gpiox_bsrr_br2,                    (gpiox_bsrr_br2_mask)

    .equ gpiox_bsrr_br3_position,           (0x13)
    .equ gpiox_bsrr_br3_mask,               (0x01 << gpiox_bsrr_br3_position)
    .equ gpiox_bsrr_br3,                    (gpiox_bsrr_br3_mask)

    .equ gpiox_bsrr_br4_position,           (0x14)
    .equ gpiox_bsrr_br4_mask,               (0x01 << gpiox_bsrr_br4_position)
    .equ gpiox_bsrr_br4,                    (gpiox_bsrr_br4_mask)

    .equ gpiox_bsrr_br5_position,           (0x15)
    .equ gpiox_bsrr_br5_mask,               (0x01 << gpiox_bsrr_br5_position)
    .equ gpiox_bsrr_br5,                    (gpiox_bsrr_br5_mask)

    .equ gpiox_bsrr_br6_position,           (0x16)
    .equ gpiox_bsrr_br6_mask,               (0x01 << gpiox_bsrr_br6_position)
    .equ gpiox_bsrr_br6,                    (gpiox_bsrr_br6_mask)

    .equ gpiox_bsrr_br7_position,           (0x17)
    .equ gpiox_bsrr_br7_mask,               (0x01 << gpiox_bsrr_br7_position)
    .equ gpiox_bsrr_br7,                    (gpiox_bsrr_br7_mask)

    .equ gpiox_bsrr_br8_position,           (0x18)
    .equ gpiox_bsrr_br8_mask,               (0x01 << gpiox_bsrr_br8_position)
    .equ gpiox_bsrr_br8,                    (gpiox_bsrr_br8_mask)

    .equ gpiox_bsrr_br9_position,           (0x19)
    .equ gpiox_bsrr_br9_mask,               (0x01 << gpiox_bsrr_br9_position)
    .equ gpiox_bsrr_br9,                    (gpiox_bsrr_br9_mask)

    .equ gpiox_bsrr_br10_position,          (0x1a)
    .equ gpiox_bsrr_br10_mask,              (0x01 << gpiox_bsrr_br10_position)
    .equ gpiox_bsrr_br10,                   (gpiox_bsrr_br10_mask)

    .equ gpiox_bsrr_br11_position,          (0x1b)
    .equ gpiox_bsrr_br11_mask,              (0x01 << gpiox_bsrr_br11_position)
    .equ gpiox_bsrr_br11,                   (gpiox_bsrr_br11_mask)

    .equ gpiox_bsrr_br12_position,          (0x1c)
    .equ gpiox_bsrr_br12_mask,              (0x01 << gpiox_bsrr_br12_position)
    .equ gpiox_bsrr_br12,                   (gpiox_bsrr_br12_mask)

    .equ gpiox_bsrr_br13_position,          (0x1d)
    .equ gpiox_bsrr_br13_mask,              (0x01 << gpiox_bsrr_br13_position)
    .equ gpiox_bsrr_br13,                   (gpiox_bsrr_br13_mask)

    .equ gpiox_bsrr_br14_position,          (0x1e)
    .equ gpiox_bsrr_br14_mask,              (0x01 << gpiox_bsrr_br14_position)
    .equ gpiox_bsrr_br14,                   (gpiox_bsrr_br14_mask)

    .equ gpiox_bsrr_br15_position,          (0x1f)
    .equ gpiox_bsrr_br15_mask,              (0x01 << gpiox_bsrr_br15_position)
    .equ gpiox_bsrr_br15,                   (gpiox_bsrr_br15_mask)


@-----------------------------------------------------------------------------------------------@
@-------------------------------- GPIOx LCKR register fields -----------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ gpiox_lckr_lckk0_position,         (0x00)
    .equ gpiox_lckr_lckk0_mask,             (0x01 << gpiox_lckr_lckk0_position)
    .equ gpiox_lckr_lckk0,                  (gpiox_lckr_lckk0_mask)

    .equ gpiox_lckr_lckk1_position,         (0x01)
    .equ gpiox_lckr_lckk1_mask,             (0x01 << gpiox_lckr_lckk1_position)
    .equ gpiox_lckr_lckk1,                  (gpiox_lckr_lckk1_mask)

    .equ gpiox_lckr_lckk2_position,         (0x02)
    .equ gpiox_lckr_lckk2_mask,             (0x01 << gpiox_lckr_lckk2_position)
    .equ gpiox_lckr_lckk2,                  (gpiox_lckr_lckk2_mask)

    .equ gpiox_lckr_lckk3_position,         (0x03)
    .equ gpiox_lckr_lckk3_mask,             (0x01 << gpiox_lckr_lckk3_position)
    .equ gpiox_lckr_lckk3,                  (gpiox_lckr_lckk3_mask)

    .equ gpiox_lckr_lckk4_position,         (0x04)
    .equ gpiox_lckr_lckk4_mask,             (0x01 << gpiox_lckr_lckk4_position)
    .equ gpiox_lckr_lckk4,                  (gpiox_lckr_lckk4_mask)

    .equ gpiox_lckr_lckk5_position,         (0x05)
    .equ gpiox_lckr_lckk5_mask,             (0x01 << gpiox_lckr_lckk5_position)
    .equ gpiox_lckr_lckk5,                  (gpiox_lckr_lckk5_mask)

    .equ gpiox_lckr_lckk6_position,         (0x06)
    .equ gpiox_lckr_lckk6_mask,             (0x01 << gpiox_lckr_lckk6_position)
    .equ gpiox_lckr_lckk6,                  (gpiox_lckr_lckk6_mask)

    .equ gpiox_lckr_lckk7_position,         (0x07)
    .equ gpiox_lckr_lckk7_mask,             (0x01 << gpiox_lckr_lckk7_position)
    .equ gpiox_lckr_lckk7,                  (gpiox_lckr_lckk7_mask)

